[
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "amount",
    "variable_type": "double",
    "column_description": "Represents the monetary value or transaction amount in UPI payment transactions, stored as a decimal number to accommodate various currency denominations and fractional amounts.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "app_resp_code",
    "variable_type": "varchar",
    "column_description": "Application-level response code for UPI transactions that indicates the status or error condition returned by the application layer, used in conjunction with NPCI response codes for comprehensive transaction error tracking and success rate calculations.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "category",
    "variable_type": "varchar",
    "column_description": "Categorizes UPI transactions by payment flow type, containing values like 'VPA2ACCOUNT', 'VPA2VPA', and 'VPA2MERCHANT' which are used to classify transactions as either Person-to-Person (P2P) or Person-to-Merchant (P2M) for business analysis and success rate calculations.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "customer_id_payer",
    "variable_type": "varchar",
    "column_description": "Unique identifier for the customer who is making the payment (payer) in UPI transactions. This field links each transaction to the specific customer account that initiated the payment, enabling payer-level analytics and success rate tracking.",
    "required_flag": "yes"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "dl_last_updated",
    "variable_type": "date",
    "column_description": "This column represents the date when the UPI transaction record was last updated or loaded into the data warehouse, used for filtering recent data and managing incremental data processing in ETL operations.",
    "required_flag": "yes"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "flow_category",
    "variable_type": "varchar",
    "column_description": "Categorizes UPI transactions by their payment flow type (e.g., P2P, 3P QR, Paytm QR, Intent, P2M Collect, Mandate_Online, Onus_ExcMandates, Mandate_Onus), which is used to group transactions into broader business categories for success rate analysis and payment flow performance tracking.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "npci_resp_code",
    "variable_type": "varchar",
    "column_description": "Contains the response code returned by NPCI (National Payments Corporation of India) for UPI transactions, indicating the processing status or error conditions at the NPCI network level. This code is used as a fallback error identifier when application-level response codes are not available.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "payee_handle",
    "variable_type": "varchar",
    "column_description": "The payee_handle column stores the payment service provider identifier or handle of the recipient in UPI transactions, used to categorize transactions by payee PSP (Paytm vs Others) for business analytics and success rate monitoring.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "payer_bank_name",
    "variable_type": "varchar",
    "column_description": "This column stores the name of the bank associated with the payer (sender) in UPI transactions, used for analyzing transaction success rates and patterns across different payer banks in P2P and P2M payment flows.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "payer_handle",
    "variable_type": "varchar",
    "column_description": "The payment service provider (PSP) handle or identifier for the entity processing the payment on behalf of the payer in UPI transactions. This field is used to categorize and analyze transaction success rates by different PSPs, particularly distinguishing between Paytm-related handles and other payment providers.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "purpose_code",
    "variable_type": "varchar",
    "column_description": "A varchar field that stores the purpose code for UPI transactions, indicating the specific reason or category for the transaction (e.g., payment type, transfer purpose) and used for transaction classification and regulatory compliance reporting.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "status",
    "variable_type": "varchar",
    "column_description": "Indicates the completion status of UPI transactions, with values like 'DEEMED' and 'SUCCESS' representing successful transaction states, used primarily for calculating transaction success rates and monitoring payment processing outcomes.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "transaction_date_key",
    "variable_type": "date",
    "column_description": "A date key that represents the transaction date for UPI transactions, used as the primary time dimension for filtering transactions by date ranges and grouping data for temporal analysis in success rate calculations and other time-based metrics.",
    "required_flag": "yes"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "transaction_type",
    "variable_type": "varchar",
    "column_description": "Specifies the type of UPI transaction operation, distinguishing between PAY transactions (money transfer initiated by payer) and COLLECT transactions (payment requests initiated by payee). This field is crucial for categorizing and analyzing different UPI transaction flows in the payment ecosystem.",
    "required_flag": "no"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "txn_id",
    "variable_type": "varchar",
    "column_description": "A unique transaction identifier for UPI transactions, used primarily for counting and aggregating transaction volumes to calculate success rates and performance metrics across different transaction categories and statuses.",
    "required_flag": "yes"
  },
  {
    "table_name": "hive.cdo.fact_upi_transactions_snapshot_v3",
    "column_name": "txn_timestamp",
    "variable_type": "timestamp(3)",
    "column_description": "Records the precise timestamp (with millisecond precision) when a UPI transaction was created or processed, used for temporal analysis and time-based filtering of transaction data in success rate calculations.",
    "required_flag": "yes"
  }
]